Revit 2026 API

# CurveLoopGetRectangularHeight Method

---

Returns the width of a curve loop if it is rectangular with respect to the projection plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetRectangularHeight(
	Plane plane
)
```
```vb
Public Function GetRectangularHeight (
	plane As Plane
) As Double
```
```cpp
public:
double GetRectangularHeight(
	Plane^ plane
)
```
```fsharp
member GetRectangularHeight :
        plane : Plane -> float
```

#### Parameters

plane Plane
     The plane to which the curves will be projected.

#### Return Value

Double The height.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The curve loop is not rectangular when projected to the input plane. |

The height is determined by the V extents of the UV curve created by from the curve loop plane.

#### Reference

CurveLoop Class

Autodesk.Revit.DB Namespace